#include "stdafx.h"
#include "esp.h"
#include "sdk.h"
#include "aim.h"
#include "settings.h"
#include "Menu.h"
#include "offsets.h"
#include"INPUT.h"
#include "spoofcall.h"
#include "aimbot.h"
#include "gamefunctions.h"
#include "xor.hpp"
#include "classes.h"
bool once = false;
using Vector2 = vec2_t;

constexpr auto FL_NO_GULAG = 1u << 2;
constexpr auto FL_IN_DUCK = 1u << 3;
constexpr auto FL_IN_PRONE = 1u << 4;
constexpr auto FL_IN_ATTACK = 1u << 10;
constexpr auto FL_CAN_MOVE = 1u << 16;
constexpr auto FL_IS_DEAD = 1u << 17;
constexpr auto FL_IN_CLIMB = 1u << 24;
constexpr auto FL_IN_ZOOM = 1u << 25;
constexpr auto FL_IN_VEHICLE = 1u << 26;

#define MAX_ENTITIES 2047



float* Rect_T::toFloat()
{
	return (float*)this;
}
void Rect_T::getRect(float x, float y, float w, float h)
{
	this->lt_x = x; this->lt_y = y; this->rt_x = x + w; this->rt_y = y; this->rb_x = x + w; this->rb_y = y + h; this->lb_x = x; this->lb_y = y + h;
}


float* Engine_Color::toFloat()
{
	return (float*)this;
}

Engine_Color* getColorFromRGB(float r, float g, float b, float t)
{
	return new Engine_Color((1.f / 255.f) * r, (1.f / 255.f) * g, (1.f / 255.f) * b, (1.f / 255.f) * t);
}


Vector2 radar_rotate(const float x, const float y, float angle)
{
	angle = (float)(angle * (M_PI / 180.f));
	float cosTheta = (float)cos(angle);
	float sinTheta = (float)sin(angle);
	Vector2 returnVec;
	returnVec.x = cosTheta * x + sinTheta * y;
	returnVec.y = sinTheta * x - cosTheta * y;
	return returnVec;
}


ImGuiWindowFlags flag_menu = ImGuiWindowFlags_::ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_::ImGuiWindowFlags_NoResize | ImGuiWindowFlags_::ImGuiWindowFlags_NoScrollbar;
ImGuiWindowFlags flag_no_menu = ImGuiWindowFlags_::ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_::ImGuiWindowFlags_NoResize | ImGuiWindowFlags_::ImGuiWindowFlags_NoScrollbar | ImGuiWindowFlags_::ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_::ImGuiWindowFlags_NoMove;
void RadarGui(sdk::player_t local_entity, sdk::player_t entity, bool IsFriendly,  DWORD color)
{



	if (Settings::esp::b_radar)
	{
	
		ImGuiStyle& style = ImGui::GetStyle();
		style.WindowMinSize = ImVec2(230, 230);
		const float bor_size = style.WindowBorderSize;
		style.WindowBorderSize = 0.0f;


		style.WindowBorderSize = bor_size;
		style.WindowPadding = ImVec2(8, 8);
		style.WindowRounding = 10.0f;
		style.ChildRounding = 0.f;
		style.FramePadding = ImVec2(5, 5);
		style.FrameRounding = 6.0f;
		style.PopupRounding = 3.f;
		style.ItemSpacing = ImVec2(8, 8);
		style.ItemInnerSpacing = ImVec2(8, 6);
		style.IndentSpacing = 25.0f;
		style.ScrollbarSize = 15.0f;
		style.ScrollbarRounding = 9.0f;
		style.GrabMinSize = 5.0f;
		style.GrabRounding = 6.0f;
		style.WindowTitleAlign = { 0.5f,0.5f };






		style.Colors[ImGuiCol_WindowBg] = ImVec4(0.06f, 0.05f, 0.07f, 0.5f);

		if (g_menu::b_menu_open)
			ImGui::Begin("Radar", 0, flag_menu);
		else
			ImGui::Begin("Radar", 0, flag_no_menu);

		Settings::esp::radar_getpos_x = ImGui::GetWindowPos().x;
		Settings::esp::radar_getpos_y = ImGui::GetWindowPos().y;
		ImGui::SetWindowPos(ImVec2(Settings::esp::radar_getpos_x, Settings::esp::radar_getpos_y));

		ImGui::SetWindowSize(ImVec2(230, 230));
		RadarSize = 233;
		RadarRadius1 = RadarSize / 2;
		imgui_draw_cross();

		g_radar::draw_entity(local_entity, entity, IsFriendly, color, ImGui::GetWindowPos(), RadarRadius1);

		ImGui::End();
	}
}







int get_player_health(int i)
{
	uint64_t bgs = *(uint64_t*)(sig_offsets::name_array);

	if (is_valid_ptr(bgs))
	{
		sdk::name_t* info = (sdk::name_t*)(bgs + 0x4C70 + (i * 0xd0));
		
		 return info->health;

		
	}
	return 0;
}
void updateInput() noexcept
{
	if (g_menu::aimbotKeyMode == 0)
		keyPressed = aimbotkey.isDown();
	if (g_menu::aimbotKeyMode == 1 && aimbotkey.isPressed())
		keyPressed = !keyPressed;
}
namespace main_game
{


	void ui_header()
	{
		ImGui::PushStyleColor(ImGuiCol_WindowBg, ImVec4(0.0f, 0.0f, 0.0f, 0.0f));
		ImGui::Begin("A", reinterpret_cast<bool*>(true), ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoBringToFrontOnFocus);
		ImGui::SetWindowPos(ImVec2(0, 0), ImGuiCond_Always);
		ImGui::SetWindowSize(ImVec2(ImGui::GetIO().DisplaySize.x, ImGui::GetIO().DisplaySize.y), ImGuiCond_Always);
	}

	void ui_end()
	{
		ImGuiWindow* window = ImGui::GetCurrentWindow();
		window->DrawList->PushClipRectFullScreen();
		ImGui::End();
		ImGui::PopStyleColor();
	}
	bool b_panic = false;
	void init(ImFont* font)
	{

		ui_header();
		esp_loop(font);
		ui_end();
	}

	struct  XModel
	{
		const char* name;
		unsigned __int16 numsurfs;
		unsigned __int8 numLods;
		unsigned __int8 collLod;
		unsigned __int16 mdaoVolumeCount;
		unsigned __int8 shadowCutoffLod;
	
	};

	class CG_ClientModel_RuntimeData
	{
	public:
		XModel* models; //0x0000
		char pad_0008[184]; //0x0008
		uint16_t modelCount; //0x00C0
		int8_t hudOutlineEnabled; //0x00C2
		bool hudOutlineFill; //0x00C3
		uint32_t hudOutlineColor; //0x00C4
		int8_t hudOutlineLineWidth; //0x00C8
		int8_t hudOutlineRenderMode; //0x00C9
		char pad_00CA[102]; //0x00CA
		uint8_t eType; //0x0130
		char pad_0131[47]; //0x0131
		vec3_t vecOrigin; //0x0160
		char pad_016C[36]; //0x016C
		vec3_t vecOrigin2; //0x0190
		char pad_019C[180]; //0x019C
	}; //Size: 0x0250

	CG_ClientModel_RuntimeData* Get_loot_By_Id(uint32_t id)
	{
		auto addr = sig_offsets::loot_ptr;
		auto ret = addr + (static_cast<uint64_t>(id) * sizeof(CG_ClientModel_RuntimeData));
		return (CG_ClientModel_RuntimeData*)ret;
	}

	struct loot
	{

		auto get_Internal_name() -> char*;
		auto weapon_name() -> const char*;


		auto is_valid() -> bool;

		auto get_position()->vec3_t;

	};

	struct loot_definition_t
	{
		char internal_name[50];
		char name[50];
		bool* show = NULL;
	};

	auto loot::get_Internal_name() -> char*
	{
		auto ptr = *(uintptr_t*)(this + 0);
		if (is_bad_ptr(ptr))
			return NULL;

		return *(char**)(ptr);
	};

	auto loot::weapon_name() -> const char*
	{
		auto ptr = (Weapon*)(this + 0xCA);

		__int64* WeaponCompleteDefptr = (__int64*)(sig_offsets::weapon_definitions);

		char* weaponName = *(char**)(WeaponCompleteDefptr[ptr->weaponIdx] + 0x18); // WEAPON/internal name

